# This is the answer creating notebook

In [4]:
import pandas as pd 
import numpy as np
import joblib

## Prepare the file

In [5]:
df = pd.DataFrame()

# get the size of the test
test1 = pd.read_csv('task1/test.csv')

df['id'] = test1['id']
df

             id
0      ANS00001
1      ANS00002
2      ANS00003
3      ANS00004
4      ANS00005
...         ...
25884  ANS25885
25885  ANS25886
25886  ANS25887
25887  ANS25888
25888  ANS25889

[25889 rows x 1 columns]

## Task1

## Modify the dataset to match the training set

In [6]:
test1.drop(['id', 'player_id'], axis = 1, inplace = True)

In [7]:
model1 = joblib.load('task1/model.pkl')

y_pred = model1.predict(test1)
y_pred

array([1., 0., 0., ..., 0., 0., 0.], shape=(25889,))

In [8]:
df['task1'] = y_pred
df

             id  task1
0      ANS00001    1.0
1      ANS00002    0.0
2      ANS00003    0.0
3      ANS00004    0.0
4      ANS00005    0.0
...         ...    ...
25884  ANS25885    0.0
25885  ANS25886    1.0
25886  ANS25887    0.0
25887  ANS25888    0.0
25888  ANS25889    0.0

[25889 rows x 2 columns]

# Task 2

In [9]:
answer2 = pd.read_csv('task2/predicted.csv')

answer2.head()

   Unnamed: 0  0
0           0  2
1           1  0
2           2  0
3           3  1
4           4  0

In [10]:
df['task2'] = [i for i in answer2['0']]

df

             id  task1  task2
0      ANS00001    1.0      2
1      ANS00002    0.0      0
2      ANS00003    0.0      0
3      ANS00004    0.0      1
4      ANS00005    0.0      0
...         ...    ...    ...
25884  ANS25885    0.0      1
25885  ANS25886    1.0      1
25886  ANS25887    0.0      3
25887  ANS25888    0.0      0
25888  ANS25889    0.0      3

[25889 rows x 3 columns]

# Task 3

In [11]:
test3 = pd.read_csv('task3/test.csv')

In [12]:
test3.drop(['id', 'player_id'], axis = 1, inplace = True)

In [13]:
test3.fillna(test3.mean(), inplace = True)

In [14]:
model3 = joblib.load('task3/model3.pkl')

y_pred = model3.predict(test3)

y_pred = np.maximum(y_pred, 0)
y_pred

array([  7204.48293248,   4437.06607585, 109102.44746348, ...,
         9165.50805029,      0.        ,      0.        ], shape=(25889,))

In [15]:
df['task3'] = y_pred

df

             id  task1  task2          task3
0      ANS00001    1.0      2    7204.482932
1      ANS00002    0.0      0    4437.066076
2      ANS00003    0.0      0  109102.447463
3      ANS00004    0.0      1       0.000000
4      ANS00005    0.0      0    1300.092167
...         ...    ...    ...            ...
25884  ANS25885    0.0      1    1904.082729
25885  ANS25886    1.0      1    3146.930342
25886  ANS25887    0.0      3    9165.508050
25887  ANS25888    0.0      0       0.000000
25888  ANS25889    0.0      3       0.000000

[25889 rows x 4 columns]

# Task 4

In [16]:
df['task4'] = [-1.0 for i in range(len(df))]

df

             id  task1  task2          task3  task4
0      ANS00001    1.0      2    7204.482932   -1.0
1      ANS00002    0.0      0    4437.066076   -1.0
2      ANS00003    0.0      0  109102.447463   -1.0
3      ANS00004    0.0      1       0.000000   -1.0
4      ANS00005    0.0      0    1300.092167   -1.0
...         ...    ...    ...            ...    ...
25884  ANS25885    0.0      1    1904.082729   -1.0
25885  ANS25886    1.0      1    3146.930342   -1.0
25886  ANS25887    0.0      3    9165.508050   -1.0
25887  ANS25888    0.0      0       0.000000   -1.0
25888  ANS25889    0.0      3       0.000000   -1.0

[25889 rows x 5 columns]

# Task 5

In [17]:
answer5 = pd.read_csv('task5/predicted.csv')

answer5.head()

   Unnamed: 0  0
0           0  1
1           1  1
2           2  1
3           3  1
4           4  1

In [18]:
df['task5'] = [1.0 if (i==-1) else 0.0 for i in answer5['0']]

df

             id  task1  task2          task3  task4  task5
0      ANS00001    1.0      2    7204.482932   -1.0    0.0
1      ANS00002    0.0      0    4437.066076   -1.0    0.0
2      ANS00003    0.0      0  109102.447463   -1.0    0.0
3      ANS00004    0.0      1       0.000000   -1.0    0.0
4      ANS00005    0.0      0    1300.092167   -1.0    0.0
...         ...    ...    ...            ...    ...    ...
25884  ANS25885    0.0      1    1904.082729   -1.0    0.0
25885  ANS25886    1.0      1    3146.930342   -1.0    0.0
25886  ANS25887    0.0      3    9165.508050   -1.0    0.0
25887  ANS25888    0.0      0       0.000000   -1.0    0.0
25888  ANS25889    0.0      3       0.000000   -1.0    0.0

[25889 rows x 6 columns]

# Save answer

In [19]:
df.to_csv('Answer.csv', index = False)